app/Controllers/Admin.php

  public function indexWisatawan()
  {
    $data = [
      'dataWisatawan' => $this->WisatawanModel->findAll(),
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first()
---
SELECT *
FROM `admin`
WHERE `id` = '1'
 LIMIT 1

  public function tambahWisatawan()
  {
    $data = [
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first(),

    ];
---
SELECT *
FROM `admin`
WHERE `id` = '1'
 LIMIT 1

  public function editWisatawan($id = null)
  {
    $data = [
      'wisatawan' => $this->WisatawanModel->where('id', $id)->first(),
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first(),
---
SELECT *
FROM `admin`
WHERE `id` = '1'
 LIMIT 1

  public function indexPemandu()
  {
    $data = [
      'dataPemandu' => $this->PemanduModel->findAll(),
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first(),
---
SELECT *
FROM `admin`
WHERE `id` = '1'
 LIMIT 1