app/Controllers/Admin.php

  public function indexWisatawan()
  {
    $data = [
      'dataWisatawan' => $this->WisatawanModel->findAll()
    ];
---
SELECT *
FROM `wisatawan`

  public function editWisatawan($id = null)
  {
    $data = [
      'wisatawan' => $this->WisatawanModel->where('id', $id)->first()
    ];
---
SELECT *
FROM `wisatawan`
WHERE `id` = '1'
 LIMIT 1

  public function indexPemandu()
  {
    $data = [
      'dataPemandu' => $this->PemanduModel->findAll()
    ];
---
SELECT *
FROM `pemandu`

  public function deletePemandu($id = null)
  {
    $this->PemanduModel->delete($id);
---
DELETE FROM `pemandu`
WHERE `id` IN ('4')