app/Controllers/Auth.php

  public function prosesLoginPemandu()
  {
    $rules = $this->validate([
      'email' => [
        'rules' => 'required',
        'errors' => [
          'required' => 'Email harus diisi'
        ]
      ],
      'password' => [
        'rules' => 'required',
        'errors' => [
          'required' => 'Password harus diisi'
        ]
      ],
    ]);

    if (!$rules) {
      session()->setFlashdata('error', $this->validator->listErrors());
      return redirect()->back()->withInput();
    }

    $email = $this->request->getVar('email');
    $password = $this->request->getVar('password');
    $cekEmail = $this->PemanduModel->where('email', $email)->first();
---
SELECT *
FROM `pemandu`
WHERE `email` = 'regina13590@gmail.com'
 LIMIT 1