app/Controllers/Destinasi.php

  public function index()
  {
    $data = [
      'dataDestinasi' => $this->DestinasiModel->findAll()
    ];
---
SELECT *
FROM `destinasi`

  public function tambah()
  {
    $data = [
      'dataKota' => $this->KotaModel->findAll()
    ];
---
SELECT *
FROM `kota`

  public function edit($id = null)
  {
    $data = [
      'dataKota' => $this->KotaModel->findAll(),
      'destinasi' => $this->DestinasiModel->where('id', $id)->first()
---
SELECT *
FROM `destinasi`
WHERE `id` = '1'
 LIMIT 1

      'image' => $newNameImage,
    ];

    $this->DestinasiModel->insert($data);
---
INSERT INTO `destinasi` (`nama`, `rekomendasi`, `kota_id`, `image`) VALUES ('Keraton Kesepuhan', 'ya', '1', '2-keraton-kasepuhan_2022-07-01_16-52-12.jpg')