app/Controllers/Kota.php

  public function index()
  {
    $data = [
      'dataKota' => $this->KotaModel->findAll()
    ];
---
SELECT *
FROM `kota`