app/Controllers/Kota.php

SELECT *
FROM `admin`
WHERE `id` = '1'
 LIMIT 1
---
  public function index()
  {
    $data = [
      'dataKota' => $this->KotaModel->findAll(),
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first(),

SELECT *
FROM `admin`
WHERE `id` = '1'
 LIMIT 1
---
  public function tambah()
  {
    $data = [
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first(),

    ];

SELECT *
FROM `kota`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `admin`
WHERE `id` = '1'
 LIMIT 1
---
  public function edit($id = null)
  {
    $data = [
      'kota' => $this->KotaModel->where('id', $id)->first(),
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first(),

    ];