app/Controllers/Pemandu.php

  public function profile()
  {
    $data = [
      'pemandu' => $this->PemanduModel->where('id', session()->get('pemandu_id'))->first()
    ];
---
SELECT *
FROM `pemandu`
WHERE `id` = '12'
 LIMIT 1

  public function editProfile($id = null)
  {
    $data = [
      'pemandu'  => $this->PemanduModel->where('id', $id)->first()
    ];
---
SELECT *
FROM `pemandu`
WHERE `id` = '1'
 LIMIT 1

            'ringkasan' => $this->request->getVar('ringkasan'),
          ];

          $this->PemanduModel->update($id, $data);
---
UPDATE `pemandu` SET `noKta` = '12345', `nama` = 'Budi Susanto 1', `telepon` = '12345', `alamat` = 'Cirebon', `jenis` = 'individu', `ringkasan` = 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has su'
WHERE `pemandu`.`id` IN ('1')

          'image' => $newNameImage
        ];

        $this->PemanduModel->update($id, $data);
---
UPDATE `pemandu` SET `noKta` = '12345', `nama` = 'Budi Susanto 1', `telepon` = '12345', `alamat` = 'Cirebon', `jenis` = 'individu', `ringkasan` = 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has su', `image` = 'default_2022-08-24_13-04-03.png'
WHERE `pemandu`.`id` IN ('1')