app/Controllers/Transaksi.php

SELECT *
FROM `admin`
WHERE `id` = '1'
 LIMIT 1
---
  public function index()
  {
    $data = [
      'dataTransaksi' => $this->CustomModel->dataTransaksi(),
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first(),