app/Controllers/Wisatawan.php

  public function index()
  {
    $kota_id = $this->request->getVar('kota_id');
    $tanggal_keberangkatan = $this->request->getVar('tanggal_keberangkatan');
    $tanggal_berakhir = $this->request->getVar('tanggal_berakhir');

    $dbTransaksi = $this->TransaksiModel->findAll();
---
SELECT *
FROM `transaksi`

    }

    if ($tanggal_keberangkatan > $tanggal_berakhir) {
      $data = [
        'dataKota' => $this->KotaModel->findAll(),
        'dataDestinasi' => $this->DestinasiModel,
        'dataTransaksi' => false,
        'tanggal_keberangkatan' => null,
        'kota_id' => null,
        'tanggal_berakhir' => null,
        'dataPemandu' => null,
        'show' => false
      ];
---
SELECT *
FROM `pemandu`
SELECT *
FROM `kota`

      return view('wisatawan/index', $data);
    }

    $data = [
      'dataKota' => $this->KotaModel->findAll(),
      'dataDestinasi' => $this->DestinasiModel,
      'dataTransaksi' => $dataTransaksi,
      'dataPemandu' => $this->PemanduModel->findAll(),
      'tanggal_keberangkatan' => $tanggal_keberangkatan,
      'kota_id' => $kota_id,
      'tanggal_berakhir' => $tanggal_berakhir,
      'show' => true
    ];
---
SELECT *
FROM `kota`
SELECT *
FROM `pemandu`

  public function profile()
  {
    $data = [
      'wisatawan' => $this->WisatawanModel->where('id', session()->get('wisatawan_id'))->first()
    ];
---
SELECT *
FROM `wisatawan`
WHERE `id` = '2'
 LIMIT 1