app/Models/CustomModel.php

  public function jadwalMemanduTerbaru($id)
  {
    $dbJadwal = $this->db->table('transaksi');

    $dbJadwal->where('pemandu_id', $id);
    $dbJadwal->join('kota', 'kota.id=transaksi.kota_id')->select('transaksi.*, kota.nama as nama_kota');
    $dbJadwal->join('pemandu', 'pemandu.id=transaksi.pemandu_id')->select('pemandu.nama as nama_pemandu');
    $dbJadwal->join('wisatawan', 'wisatawan.id=transaksi.wisatawan_id')->select('wisatawan.nama as nama_wisatawan');
    $dbJadwal->limit(5);
    $dbJadwal->orderBy('id', 'DESC');


    return $dbJadwal->get()->getResultArray();
---
SELECT `transaksi`.*, `kota`.`nama` as `nama_kota`, `pemandu`.`nama` as `nama_pemandu`, `wisatawan`.`nama` as `nama_wisatawan`
FROM `transaksi`
JOIN `kota` ON `kota`.`id`=`transaksi`.`kota_id`
JOIN `pemandu` ON `pemandu`.`id`=`transaksi`.`pemandu_id`
JOIN `wisatawan` ON `wisatawan`.`id`=`transaksi`.`wisatawan_id`
WHERE `pemandu_id` = '1'
ORDER BY `id` DESC
 LIMIT 5

  public function dataDestinasi()
  {
    $dbDestinasi = $this->db->table('destinasi');
    $dbDestinasi->join('kota', 'kota.id=destinasi.kota_id')->select('destinasi.*, kota.nama as nama_kota');

    $dbDestinasi->orderBy('nama', 'ASC');

    return $dbDestinasi->get()->getResultArray();
---
SELECT `destinasi`.*, `kota`.`nama` as `nama_kota`
FROM `destinasi`
JOIN `kota` ON `kota`.`id`=`destinasi`.`kota_id`
ORDER BY `nama` ASC

  public function dataTransaksi()
  {
    $dbJadwal = $this->db->table('transaksi');

    $dbJadwal->join('kota', 'kota.id=transaksi.kota_id')->select('transaksi.*, kota.nama as nama_kota');
    $dbJadwal->join('pemandu', 'pemandu.id=transaksi.pemandu_id')->select('pemandu.nama as nama_pemandu');
    $dbJadwal->join('wisatawan', 'wisatawan.id=transaksi.wisatawan_id')->select('wisatawan.nama as nama_wisatawan');
    $dbJadwal->orderBy('id', 'DESC');


    return $dbJadwal->get()->getResultArray();
---
SELECT `transaksi`.*, `kota`.`nama` as `nama_kota`, `pemandu`.`nama` as `nama_pemandu`, `wisatawan`.`nama` as `nama_wisatawan`
FROM `transaksi`
JOIN `kota` ON `kota`.`id`=`transaksi`.`kota_id`
JOIN `pemandu` ON `pemandu`.`id`=`transaksi`.`pemandu_id`
JOIN `wisatawan` ON `wisatawan`.`id`=`transaksi`.`wisatawan_id`
ORDER BY `id` DESC

  public function dataTransaksiById($id)
  {
    $dbJadwal = $this->db->table('transaksi');

    $dbJadwal->where('transaksi.id', $id);
    $dbJadwal->join('kota', 'kota.id=transaksi.kota_id')->select('transaksi.*, kota.nama as nama_kota');
    $dbJadwal->join('pemandu', 'pemandu.id=transaksi.pemandu_id')->select('pemandu.nama as nama_pemandu');
    $dbJadwal->join('wisatawan', 'wisatawan.id=transaksi.wisatawan_id')->select('wisatawan.nama as nama_wisatawan');
    $dbJadwal->orderBy('id', 'DESC');


    return $dbJadwal->get()->getResultArray();
---
SELECT `transaksi`.*, `kota`.`nama` as `nama_kota`, `pemandu`.`nama` as `nama_pemandu`, `wisatawan`.`nama` as `nama_wisatawan`
FROM `transaksi`
JOIN `kota` ON `kota`.`id`=`transaksi`.`kota_id`
JOIN `pemandu` ON `pemandu`.`id`=`transaksi`.`pemandu_id`
JOIN `wisatawan` ON `wisatawan`.`id`=`transaksi`.`wisatawan_id`
WHERE `transaksi`.`id` = '4'
ORDER BY `id` DESC